''' 순서도 기호 살펴보기
- 데이터(사다리꼴) : 데이터는 기억 장치를 지정하지 않은 데이터 자체를 나타냅니다.

- 처리(직사각형) : 처리는 여러 종류의 처리 기능을 나타냅니다. 즉 정보의 값-형-위치를 바꾸도록 정의한 연산이나 연산 집합의 실행, 또는 연속하는 몇 가지 흐름 가운데 하나의 방향을 결정하는 연산이나 연산 집합의 실행을 나타냅니다.

- 미리 정의한 처리(왼쪽에 선이 한개 그어진 직사각형) : 미리 정의한 서브루틴이나 모듈 등 다른 곳에서 이미 정의한 하나 이상의 연산 또는 명령으로 이루어진 처리를 나타냅니다.

- 판단(마름모) : 판단은 하나의 입구와 하나 이상을 선택하는 출구가 있고, 판단 기호안에 정의한 조건을 평가하여 하나의 출구를 선택하는 판단 기능(스위치형 기능)을 나타냅니다.

- 루프 범위(햄버거) : 햄버거 빵 사이에 처리(직사각형)을 넣어준다.

- 선(선, 화살표) : 선은 제어의 흐름을 의미하며, 흐름의 방향을 분명히 나타낼 때는 화살표를 사용합니다.

- 단말(둥근 직사각형) : 단말은 외부 환경으로 나가거나 외부 환경에서 돌아오는 것을 나타냅니다. 주로 프로그램의 흐름의 시작과 종료를 나타냅니다.
'''